/**
 * 🎉🎉🎉 GENERATE BY @yike-design/cli
 * ⚠️⚠️⚠️ DO NOT EDIT IT MANUALLY
 */

import React from 'react';

const GroupOutlined = React.forwardRef((props: React.SVGProps<SVGSVGElement>, ref: React.Ref<SVGSVGElement>) => (
  <svg
    viewBox="0 0 1331 1024"
    fill="currentColor"
    width="1em"
    height="1em"
    ref={ref}
    {...props}
  >
    <path d="M512 76.8a217.6 217.6 0 1 1 0 435.2 217.6 217.6 0 0 1 0-435.2zm307.2 0a217.6 217.6 0 1 1-101.66 410.04 281.11 281.11 0 0 0 44.9-63.6 140.8 140.8 0 1 0 0-257.74 282.09 282.09 0 0 0-44.85-63.54A216.2 216.2 0 0 1 819.2 76.8zM512 153.6a140.8 140.8 0 1 0 0 281.6 140.8 140.8 0 0 0 0-281.6zm0 409.6c237.18 0 432.54 179.2 457.98 409.6H892.6l-.57-4.15c-26.44-183.27-182.32-324.68-372-328.57L512 640c-193.28 0-353.23 142.8-380.03 328.65l-.6 4.15H54.03C79.46 742.4 274.82 563.2 512 563.2zm307.2 0c237.18 0 432.54 179.2 457.98 409.6h-77.38l-.57-4.15c-23.96-166.01-154.11-297.67-319.38-323.89a538.8 538.8 0 0 0-108.68-79.1 465 465 0 0 1 48.03-2.46z" />
  </svg>
));

export default GroupOutlined;
